Documents/ТестированиеПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ТестированиеПользователей</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПравильныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравоваяБаза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыПользователям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравильныйОтвет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВопросыПользователям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВопросыПользователям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравоваяБаза</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВопроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ТестированиеПользователей/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьВопросыПоТеме()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПравоваяБаза", Объект.Тема);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВопросыПользователям.ТекстВопроса,
	|	ВопросыПользователям.СписокОтветов.(
	|		Ссылка,
	|		НомерСтроки,
	|		Ответ,
	|		Правильный
	|	),
	|	ВопросыПользователям.Ссылка
	|ИЗ
	|	Справочник.ВопросыПользователям КАК ВопросыПользователям
	|ГДЕ
	|	НЕ ВопросыПользователям.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ПравоваяБаза = ЗНАЧЕНИЕ(Справочник.ПравоваяБаза.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВопросыПользователям.Владелец = &ПравоваяБаза
	|		КОНЕЦ";
	
	ВсеВопросыПоТеме = Запрос.Выполнить().Выгрузить();
	ВсегоВопросов = ВсеВопросыПоТеме.Количество();
	
	Если НЕ ЗначениеЗаполнено(Объект.Тема) Тогда
		КоличествоВопросов = ВсегоВопросов;
	КонецЕсли;
	
	Если ВсегоВопросов = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По теме " + Объект.Тема + " нет вопросов");
	Иначе
		
		МассивНомеровВопросов = Новый Массив;
		Для Сч = 0 По ВсегоВопросов - 1 Цикл
			МассивНомеровВопросов.Добавить(Сч);
		КонецЦикла;
		
		// Чтобы вопросы в разном порядке были.
		МассивСЧ = Новый Массив;
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		
		Пока МассивСЧ.Количество() < КоличествоВопросов Цикл
			
			СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, МассивНомеровВопросов.ВГраница());
			МассивСЧ.Добавить(МассивНомеровВопросов.Получить(СлучайноеЧисло));
			МассивНомеровВопросов.Удалить(СлучайноеЧисло);
			
		КонецЦикла;
		
		Для каждого СлучайноеЧисло Из МассивСЧ Цикл
			
			НовыйВопрос = СлучайныеВопросы.Добавить();
			НовыйВопрос.Ссылка = ВсеВопросыПоТеме[СлучайноеЧисло].Ссылка;
			НовыйВопрос.СписокОтветов.Загрузить(ВсеВопросыПоТеме[СлучайноеЧисло].СписокОтветов); // Ответы надо тоже в разном порядке загружать.
			НовыйВопрос.ТекстВопроса = ВсеВопросыПоТеме[СлучайноеЧисло].ТекстВопроса;
			НовыйВопрос.Тема = ВсеВопросыПоТеме[СлучайноеЧисло].Тема;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьВопрос(НомерВопроса)
	
	ОбновитьФорму();
	Элементы.ТекстВопроса.Заголовок = СлучайныеВопросы[НомерВопроса].ТекстВопроса;
	ОтветПользователя.Очистить();
	Для каждого Ответ Из СлучайныеВопросы[НомерВопроса].СписокОтветов Цикл
		СтрокаТЧ = ОтветПользователя.Добавить();
		СтрокаТЧ.Ответ = Ответ.Ответ;
		СтрокаТЧ.Правильный = Ответ.ОтветПользователя;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьОтвет(НомерВопроса)
	Для каждого Ответ Из СлучайныеВопросы[НомерВопроса].СписокОтветов Цикл
		
		Ответ.ОтветПользователя = ОтветПользователя[СлучайныеВопросы[НомерВопроса].СписокОтветов.Индекс(Ответ)].Правильный;
		
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура СледующийВопрос(Команда)
	
	ЗаписатьОтвет(ТекущийВопрос);
	ТекущийВопрос = ТекущийВопрос + 1;
	ПолучитьВопрос(ТекущийВопрос);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийВопрос(Команда)
	
	ЗаписатьОтвет(ТекущийВопрос);
	ТекущийВопрос = ТекущийВопрос - 1;
	ПолучитьВопрос(ТекущийВопрос);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	//Элементы.ТекущийВопрос.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Вопрос %1 из %2", ТекущийВопрос+1, КоличествоВопросов);
	
	Если ТекущийВопрос <= 0 Тогда
		
		Элементы.ПредыдущийВопрос.Доступность = Ложь;
		Элементы.СледующийВопрос.Доступность = Истина;
		
	ИначеЕсли ТекущийВопрос = КоличествоВопросов - 1 Тогда
		
		Элементы.ПредыдущийВопрос.Доступность = Истина;
		Элементы.СледующийВопрос.Доступность = Ложь;
		
	Иначе
		
		Элементы.ПредыдущийВопрос.Доступность = Истина;
		Элементы.СледующийВопрос.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗакончитьТестированиеНаСервере()
	Объект.ВремяОкончанияТестирования = ТекущаяДата();
	ВсегоПравильных = 0;
	Для каждого Вопрос Из СлучайныеВопросы Цикл
		
		ПравильныйОтвет = Истина;
		ОбъектВопрос = Объект.ВопросыТеста.Добавить();
		ОбъектВопрос.Вопрос = Вопрос.Ссылка;
		
		Для каждого Ответ Из Вопрос.СписокОтветов Цикл
			
			Если НЕ (Ответ.Правильный = Ответ.ОтветПользователя) Тогда
				
				ПравильныйОтвет = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		ОбъектВопрос.ПравильныйОтвет = ПравильныйОтвет;
		ВсегоПравильных = ВсегоПравильных + ПравильныйОтвет;
	КонецЦикла;
	
	Возврат ВсегоПравильных;
	
КонецФункции

&НаКлиенте
Процедура НачатьТестирование(Команда)
	
	ПолучитьВопросыПоТеме();
	ТекущийВопрос = 0;
	Объект.ВремяНачалаТестирования = ТекущаяДата();
	ПолучитьВопрос(ТекущийВопрос);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Тема", Объект.Тема);
		ПараметрыФормы.Вставить("КоличествоВопросов", 333);
		
		Ответ = ОткрытьФормуМодально("Документ.ТестированиеПользователей.Форма.ФормаНачалоТеста", ПараметрыФормы, ЭтаФорма);
		
		Отказ = НЕ Ответ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗакончитьТестированиеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Тема") Тогда
		Объект.Тема = Параметры.Тема;
		
		// Выбираем все вопросы по теме, или 20 вопросов для теста по всем темам.
		Если НЕ ЗначениеЗаполнено(Объект.Тема) Тогда
			КоличествоВопросов = 20;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
КонецПроцедуры
